# Можемо од рачунара затражити да се нека локација у меморији резервише.
# Тој локацији у меморији ми дајемо име, и дефинишемо вредност коју ће имати.
# Када у програму напишемо име те променљиве, програм користи ту меморијску локацију.
# Пајтон не третира типове података као трајне, и промениће тип податка који променљива
# садржи ако у њу унесемо нешто што њен претходни тип податка није могао да садржи.

# Функција print() служи да нешто испишемо на конзолу.
# Ако вас занима детаљније како ради, 
# можете отворити objasnjenje_print.py кад завршите с овим.
# Овде користимо да видите шта се дешава кад покренете програм.
print ("##################################################")
print()

# Када будете користили овај код, проширите прозорчић терминала, и гледајте и код
# и испис на терминалу да би могли да поредите шта се исписује на основу чега

print ("Пример 1 - Додела:")
a = 5
b = 8
print ("a =", a)
print ("b =", b)
print()

# Пример 1: Пајтон на основу прве вредности коју смо дали променљивој дефинише тип 
# податка који та променљива садржи. Овде смо задали цео број, 
# па ће користити целобројни тип
# int - интегер

print ("Пример 2 - Измена:")
a = 10
b = 3
print ("a =", a)
print ("b =", b)
print()

# Пример 2: Ми у било ком тренутку можемо тој променљивој да задамо неку нову вредност.
# Код који се изврши након те промене ће користити ову нову вредност.

print ("Пример 3 - Сабирање и одузимање:")
a = a + 2
b = a - 2
print ("a =", a)
print ("b =", b)
print()

# Пример 3: Можемо да променимо вредности променљивих користећи њу саму
# или друге променљиве, као и операторе и функције.
# О операторима и функцијама ћемо више причати другде.
# НАПОМЕНА: Када користимо исту променљиву са обе стране једнакости, не читамо је исто
# НАПОМЕНА: Са леве стране = читамо је као нову вредност променљиве
# НАПОМЕНА: Са десне стране = читамо је као стару вредност променљиве
# a = a + 2 нам заправо значи "нова вредност променљиве а нам је старо а + 2"

print ("Пример 4: Множење и степеновање")
a = b * 3
b = b ** 3
print ("a =", a)
print ("b =", b)
print()

# Пример 4: Оператор * нам значи множење када га употребимо једном, а степеновање када
# га удвостручимо у оператор **

print ("Пример 5: Целобројно дељење и остатак")
a = b // 3
b = b % 3
print ("a =", a)
print ("b =", b)
print()

# Пример 5: Оператор // нам значи целобројно дељење
# Оператор % нам значи остатак при дељењу

print ("Пример 6: Реални бројеви и њихово дељење")
a = 1000.0
b = 1000 / 3
print ("a =", a)
print ("b =", b)
print()
# Пример 6: Оператор / нам значи дељење бројева као целих
# Ако променљивој доделимо вредност која је реални број,
# њен тип ће се променити у реални тип.

print ("Пример 7: Логичке вредности")
a = True
b = False
print ("a =", a)
print ("b =", b)
print()

kupio_cigare = True
kupio_sok = False

print ("Cigare =", kupio_cigare)
print ("Sok je kupljen:", kupio_sok)
# Пример 7: Наше променљиве сада садрже у себи логичке вредности тачно и нетачно,
# односно истинито и неистинито, односно True и False.

print ("Пример 8: Логичке операције")
a = a and b
b = 5 > 3
print ("a =", a)
print ("b =", b)
print()
# Пример 8: Логичким променљивама можемо да вршимо логичке операције,
# али такође можемо у њима да памтимо резултате неких провера.
# У овом примеру, памтимо да ли је 5 веће од 3 (јесте).

print ("Пример 9: Редослед операција")
a = 5
b = a < 10 or a > 13 # тачно, 5 < 10 ИЛИ 5 > 13
a = a + 2 == 6 # нетачно, 7 није једнако 6
print ("a =", a)
print ("b =", b)
print()
# Пример 9: Променљива користи додељену вредност све док јој се не додели нека нова.
# Операције доделе = се извршавају последње.
# Пре њих се извршавају логичке операцији попут or
# Пре њих се извршавају поређења попут ==
# А прве се раде математичке операције, истим редом као и у математици
# Заграде могу да промене редослед кад нам треба нешто преко реда да се обави
# НАПОМЕНА: Није препоручљиво стално мењати тип податка једне променљиве као овде
# Боље је направити одвојене променљиве за тако нешто. Ово је само пример

# Ако сте ово све изнад разумели, то вам је довољно да радите са променљивама
# Слободно се поиграјте са овим кодом, ако настане нека грешка коју не знате да решите
# можете увек да поново преузмете овај код са сајта, и да нас питате шта се десило.