# Пре овога погледати:
# objasnjenje_promenljive.py
# objasnjenje_print.py

# Нова функција:
# input ("неки текст")
# Ова функција исписује текст садржан унутар наводника,
# и тражи од корисника да унесе неки свој текст.
# Кликните на прозорчић терминала да би унели тај текст.
# Овај текст се чита као стринг, и као повратна вредност уписује у неку променљиву
print ("##################################################")
print ("Коментари у овом коду објашњавају функцију input()")
print ("Исписи на конзолу такође објашњаваја функцију input()")
print()

input ("Оно што унесете овде неће бити сачувано: ")
print ("Да би било сачувано, морате бити смештено у неку променљиву")
rezultat = input ("Унесите нешто опет, ово ће бити сачувано у резултат: ")

print ("Написали сте ово:", rezultat)
print()
print ("Као тип податка, ово што сте унели је стринг.")
print ("Чак и ако смо унели број,", rezultat + rezultat,"ће бити написано као спојени стрингови")
print ("а не као збир.")
print()
input ("Притисните ентер да наставите")

print ("Постоје два начина да решимо овај проблем.")
print ("Један је да пре уписа у променљиву наредимо програму та наш унос тумачи као цео број")
rezultat = int(input ("Унесите неки цео број:"))
# Ако вам програм овде пукне, и искочи следећи текст:
# ValueError: invalid literal for int() with base 10: 'ваш текст'
# Програм вам јавља да се десила грешка у уносу вредности (ValueError)
# И да се десио изузетак који му није показано како да реши
# Текст који сте унели не зна како да преведе у цео број
print ("Ову вредност можемо да користимо као број.")
print ("Када је саберемо са собом унутар исписа, добијамо",rezultat + rezultat)
print()
print ("Други начин је да ово унесемо као стринг, а онда касније променимо тип променљиве.")
rezultat = input ("Унесите неки реални број (користећи . уместе , за цифре мање од нуле): ")
rezultat = float(rezultat)
# Ако вам програм овде пукне, и искочи следећи текст:
# ValueError: could not convert string to float: 'ваш текст овде'
# Програм вам јавља да се десила грешка у уносу вредности (ValueError)
# И да се десио изузетак који му није показано како да реши
# Текст који сте унели не зна како да преведе у float тип реалног броја
print (rezultat, "је реални број.")
print ("Овај приступ је бољи јер пре промене типа податка, можемо да проверимо да ли је")
print ("све унето како треба, и нешто урадимо ако није, уместо да нам пукне програм.")

# Ако сте ово све изнад разумели, то вам је довољно да радите са функцијом input()
# Слободно се поиграјте са овим кодом, ако настане нека грешка коју не знате да решите
# можете увек да поново преузмете овај код са сајта, и да нас питате шта се десило.