# Пре овога погледати:
# objasnjenje_promenljive.py

# Нова функција:
# print ("неки текст")
# Ова функција исписује текст садржан унутар наводника, и прелази у следећи ред.
# Ако оставимо заграде празним, само прескаче ред.

print ("##################################################")
print ("Коментари у овом коду објашњавају функцију print()")
print()
# Текст написан унутар заграда се складишти и користи као тип податка str - стринг
# Када будете користили овај код, проширите прозорчић терминала, и гледајте и код
# и испис на терминалу да би могли да поредите шта се исписује на основу чега

# print може и да комбинује више различитих исписа у једном реду.
# Користимо више одвојених делова унутар наводника са зарезом између сваког
# Сви морају бити унутар заграде
print ("Ово", "је", "пример исписа више стрингова унутар једног позива print()")
print()
# Пајтон ће додати размак после сваког зареза

# Ако не желимо размаке, можемо да користимо знак + уместо зареза
print ("Нај"+"лакши", "задатак вам ће бити да разумете излазе испод")
print()
# НАПОМЕНА: Да би ово радило како треба, са обе стране знака + морају бити стрингови

# Постоје посебни симболи које можемо убацити у позив ове фукције
# На пример, \n нам служи да скочимо у нови ред.
print ("Овај стринг\nје поцепан\nу три реда")
print()
# Касније ћемо вам објаснити друге овакве симболе и како да их употребите.

# Овако можемо исписати и променљиве.
# Да се подсетимо, променљиве су локације у меморији које имају своје име и тип податка
# Кад год употребимо њихово име, наш програм ће прочитати ту локацију у меморији
# И употребити вредност коју ту нађе уместо имена наше променљиве
# Оне не иду унутар наводника.
ime = "Именко"
prezime = "Презименковић"
print ("Име ученика је:", ime)
print ("Презиме ученика је:", prezime)
print()
# Ако у коду промените вредност променљивих, промениће се и испис.

# Број година је цео број, који се складишти и користи у типу податка int - интегер
# Иако није стринг, Пајтон зна како да претвори број у стринг који се може исписати
godina = 16
print ("Ученик има", godina, "година")
print()
# Као и за име и презиме, ако промените број година, промениће се и број у испису

# Ако имамо integer променљиве које садрже цифре,
# Ако хоћемо да испишемо те цифре као један број, мораћемо да пазимо шта радимо.
# Ако употребимо знак + онда ће наше цифре бити сабране
print ("Пример нетачног исписа цифара:")
prva_cifra = 4
druga_cifra = 6
print (prva_cifra + druga_cifra)
print()

# Да би се ово лепо исписало, морамо прецизније објаснити Пајтону шта желимо да урадимо.
# Пошто желимо да се цифре споје као да су стрингови, морамо их претворити у стринг
# То се ради такозваним кастовањем. Позовемо тип податка, и у загради име променљиве
# str(име наше променљиве)
print ("Пример тачног исписа цифара:")
prva_cifra_string = str(prva_cifra)
druga_cifra_string = str(druga_cifra)
print (prva_cifra_string + druga_cifra_string)
print()

# Не морамо да користимо додатне променљиве за ово.
# Кастовање можемо да радимо и унутар позива функције print()
print ("Други пример тачног исписа цифара:")
print (str(prva_cifra) + str(druga_cifra))
print()

# Ако сте ово све изнад разумели, то је довољно да користите функцију print()
# Слободно се поиграјте са овим кодом, ако настане нека грешка коју не знате да решите
# можете увек да поново преузмете овај код са сајта, и да нас питате шта се десило.
