# Пре овога погледати:
# objasnjenje_skupova.py
# objasnjenje_grananja.py
print ("##################################################")
print()

# У Пајтону, низови су један од начина чувања више података у једној променљивој
# Представљају једну од основних алатки за рад и већини програмских језика
# У Пајтону се ретко користе директно. У овом примеру ћемо све време користити
# нешто што се зове "листа", али користићемо је као да користимо низ.
# Постоје разлике међу њима које ћемо касније објаснити. Низ је једноставнији.
# Низ (или листу) правимо тако што неку вредност ставимо у угласте заграде []

Niz = []
print (Niz)
print ()

# Као и са скуповима, вредности се уписују са зарезом између

Niz = [1, False, "бла", True, 1]
print (Niz)
print ()

# Приметите да нам се овај пут вредности исписују тачно оним редоследом којим смо их
# уписали. То је зато што су низови уређен тип податка, и редослед је важан.
# То што је редослед важан можемо употребити да приступимо тачно одређеном члану низа.
# Члану низа се приступа преко угластих заграда [], и броје се од нуле.

print ("Члан низа са редним бројем 0:", Niz[0])
print ("Члан низа са редним бројем 1:", Niz[1])
print ("Члан низа са редним бројем 2:", Niz[2])
print ("Члан низа са редним бројем 3:", Niz[3])
print ("Члан низа са редним бројем 4:", Niz[4])
print()

# Пошто нам редослед значи нешто, није никакав проблем што нам елемент 0 и елемент 4
# имају исту вредност 1. Ако имати списак за куповину, и прво на списку вам је млеко
# кога купујете једну литру, а последње на списку вам је брашно, кога купујете један
# килограм, то су два различита податка, и немају везе један с другим.

#print ("Члан низа са редним бројем 5:", Niz[5])
# Ако извршите ред кода у коментару изнад, десиће се изузетак
# IndexError: list index out of range
# Тај изузетак значи да сте покушали да приступите непостојећем члану низа
# Низу од 5 чланова је последњи члан са редним бројем 4

# Као и са скуповима, дужину низа добијамо користећи функцију len()
print ("Дужина низа Niz:", len(Niz))
print()

# Елементе низа можемо да променимо. Као што елементу приступамо преко редног броја
# да би га прочитали, тако му приступамо преко редног броја да би у њега писали
Niz[0]="нова вредност"
Niz[3]=True
print (Niz)
print ()

# Niz[5]=0
# Ако извршите ред кода у коментару изнад, десиће се изузетак
# IndexError: list assignment index out of range
# Тај изузетак значи да сте покушали да измените непостојећи члан низа

# Ако желимо да приступимо само делу низа, то радимо преко оператора :
# Ако желимо да узмемо прва два елемента низа, то ћемо написати овако [:2]
print ("Прва два елемента:", Niz[:2])
# Обратите пажњу да су нам исписани елементи 0 и 1, али не и елемент 2
print ()

# Ако желимо да приступимо свим елементима од елемента бро 3, то нам је [3:]
print ("Елементи почевши од редног броја 3:", Niz[3:])
# Када од њега крећемо, елемент 3 нам је исписан
print ()

# Ако желимо елементе од редног броја 1 до редног броја 3, то нам је [1:4]
# Приметите да користимо 4, а не 3. Да смо хтели и 4 да испишемо, писали би 5
print ("Елементи почевши од редног броја 1 до редног броја 3:", Niz[1:4])
print ()

# Листу и низ можемо помножити са неким бројем да направимо већу листу
# која се понавља
print ("Испод исписујем наш низ 2 пута")
veci_niz = Niz * 2
print (veci_niz)
print()

# Ако хоћемо да припремимо празну листу неке дужине с којим можемо после да радимо,
# најлакше нам је да то урадимо помоћу множења
NoviNiz = [None]*10
duzinaNiza = len(NoviNiz)
print ("Направили смо низ дужине", duzinaNiza)
print ("Редни број последњег елемента је", duzinaNiza-1)
NoviNiz[0] = "Први елемент"
NoviNiz[duzinaNiza-1] = "Последњи елемент"
print (NoviNiz)

# Нешто слично овоме радимо и у другим програмским језицима, где кажемо програму
# унапред колико желимо да нам буде дугачан неки низ,
# и програм унапред одвоји меморије где ће да се смести
