# Пре овога погледати:
# objasnjenje_promenljive.py
print ("##################################################")
print()

# У Пајтону, скупови су један од начина чувања више података у једној променљивој
# Понашају се слично скуповима у математици, и над њима се могу вршити сличне операције
# Скуп правимо тако што неку вредност ставимо у витичасте заграде {}

skup = {}
print (skup)
print ()

# Ово је празан скуп. Ако желимо да направимо скуп који има већ неки садржај,
# то можемо да урадимо овако:

skup = {3, 5, False, "пример", True, 4.3}
# Стављамо зарез између сваке вредности

print (skup)
# Приметите да редослед исписа није исти као редослед којим смо доделили вредности.
# Скупови су такозвани "неуређени" тип податка. Редослед им није битан, редослед им
# се не памти, и програм их смешта онако како је најзгодније да се сачувају.
print ()

# Када кажем да скуп садржи вредности, избор речи ми је намеран.
# Ако кажемо да је нека променљива у неком скупу, ми у тај скуп стављамо
# њену тренутну вредност. Ако се вредност променљиве промени, то не мења скуп.
# У њему је и даље стара вредност те променљиве.
a = 4
skup = {a}
print ("a = ", a, "skup = ", skup)
a = 3
print ("a = ", a, "skup = ", skup)
print ()

# Ако хоћемо да мењамо скупове, то радимо преко операција рада са скуповима.
# На пример, користили би унију скупова да проширимо неки скуп.
# Ако хоћемо да додамо нешто што није скуп, онда прво од тога направимо скуп.
skupA = {True, 4, "skupA"}
print ("Скуп А је", skupA)
skupB = {True, "skupB"}
print ("Скуп Б је", skupB)
print ()

# Оператор уније скупова је |
skupAunijaB = skupA | skupB
print ("Унија скупова А и Б је", skupAunijaB)
# Приметимо да се исти елементи не понављају. Један елемент не може бити двапут у скупу.
# Или јесте у скупу, или није у скупу.

# Оператор пресека скупова је &
skupApresekB = skupA & skupB
print ("Пресек скупова А и Б је", skupApresekB)

# Оператор разлике скупова (то јест, свих елемената првог скупа који нису у другом) је -
skupAbezB = skupA - skupB
print ("Скуп А без елемената скупа Б је", skupAbezB)

# Оператор симетричне разлике скупова (тј, свих елемената који им нису заједнички) је ^
skupArazlicitoB = skupA ^ skupB
print ("Различити елементи скупова А и Б су", skupArazlicitoB)
print ()

# Можемо проверити да ли је нека вредност елемент неког скупа користећи оператор IN
skup = {3, False, "пример"}
rezultat = 3 in skup
print ("Тврдња да се 3 налази у скупу skup:", rezultat)
rezultat = True in skup
print ("Тврдња да се True налази у скупу skup:", rezultat)

# Можемо видети колико скуп има чланова користећи функцију len()
print ("Број чланова скупа skup је", len(skup))
print ()

# Постоји трик да брзо проверимо да ли је скуп празан.
prazan_skup = {}
pun_skup = {3, 5, False}
print ("Тврдња да", prazan_skup,"није празан:",bool(prazan_skup))
print ("Тврдња да", pun_skup,"није празан:",bool(pun_skup))
# Ако скуп кастујемо у истинитосну вредност bool, она ће бити False ако је скуп празан,
# а у супротном ће бити True

# Члановима скупа приступамо користећи петље.
# О томе више у objasnjenje_petlji.py




