# Пре овога погледати:
# objasnjenje_funkcija.py

print ("##################################################")
print()

# Кључну реч IF користимо да направимо гранање. Сама по себи, прави просто гранање
# које нешто ради ако је услов испуњен, а ништа ако услов није испуњен.
# IF услов: садржај блока гранања

if 2 + 2 == 4:
    print ("Два и два су четири")
    print ("Ово је грана коју увек добијамо јер је услов увек тачан")
if 2 + 2 != 4:
    print ("Два и два нису четири")
    print ("Ово је грана коју никад не добијамо јер је услов увек нетачан")

# У оквиру програма, потребан нам је начин да назначимо блокове кода. Многи програмски
# језици користе кључне речи или посебне симболе да означе почетак и крај блока.
# У пајтону, почетак блока се назначава прављењем табулације, а крај блока се назначава
# враћањем на претходну табулацију. Блок може да садржи друге блокове, и због тога
# постоји више нивоа табулације. Постоје ситуације где, ако наш блок садржи само једну
# линију кода, можемо оставити тај блок у истом реду са управљачком наредбом која га је
# позвала.

def dalje(sekcija = None):
    print()
    if sekcija!=None: print ("Секција:", sekcija)
    input ("Притисните ентер да наставите")
    print()

# Овде сам поново дефинисао моју функцију "dalje()"
# Али овај пут сам додао једно просто гранање које се ослања на опциони параметар
# Оно ми омогућава да без много труда додам испис назива секције програма коју
# тренутно објашњавам, а прескачем тај испис ако то не желим.

dalje("if")

# Кључне речи ELSE и ELIF користимо да направимо додатне гране у оквиру једног гранања.
# Ако имамо само IF и ELSE, онда нам блок уз IF представља блок који ће се извршити ако
# је услов испуњен, а ELSE представља блок који ће се извршити ако услов није испуњен.

uslov = True

# Да измените која се грана извршава, промените uslov изнад на uslov = False

if uslov:
    print ("Услов је испуњен")
else:
    print ("Услов није испуњен")

dalje("else")

# Кључна реч ELIF нам представља скраћено ELSE IF. Користи се да би се олакшало писање
# сложенијих услова, када нам гранање прави 3 или више грана. Сада нам ELSE значи да
# ниједан од ових претходних услова није испуњен.

broj = 1

# Да измените која се грана извршава, промените broj изнад

if broj == 0:
    print ("Нула")
elif broj == 1:
    print ("Један")
elif broj == 2:
    print ("Два")
else:
    print ("Није ни 0 ни 1 ни 2")

dalje("elif")

# Важно је напоменути да нам је неопходно да ниједан од претходних услова није тачан
# да би ушли у неко ELIF. Као пример проблема који могу да настану ако нисмо пажљиви,
# погледајмо овај код:

uslov1 = True
uslov2 = True

if uslov1:
    print ("Први услов је испуњен")
elif uslov2:
    print ("Други услов је испуњен")

dalje("Проблеми са elif")

# Иако су нам оба услова тачна, исписује се само блок за први услов!
# Да би у случају да су оба истинита исписали оба, требају нам два одвојена if блока

if uslov1:
    print ("Први услов је испуњен")
if uslov2:
    print ("Други услов је испуњен")

# Наравно, и обрнут проблем може да постоји. 
# Ако желите да се од више понуђених опција можедесити само једна,
# користите ELIF и ELSE

dalje("Прерађено са if")

# IF ELIF ELSE блокови имају тачно одређен редослед који је неопходан да би били
# једна целина.
# IF услов1: блок1
# ELIF услов2: блок2
# ELIF услов3: блок3
# ...
# ELIF условN: блокN
# ELSE: блокM
# Гранање које почиње са IF се завршава или кад се заврши блок у ком је,
# или кад наиђемо на неку команду која није ни ELIF ни ELSE, 
# а ако имамо ELSE оно мора бити последња грана.

uslov1 = False
uslov2 = True

# У овом коду испод, на који услов се односи ELSE?

if uslov1: print("Услов 1 је испуњен")
if uslov2: print("Услов 2 је испуњен")
else: print ("Услов није испуњен")

# Ако се поиграмо са вредностима uslov1 и uslov2, видећемо да нам се ELSE односи
# наше друго IF. Када компајлер "чита" наш код, први if се завршио кад је
# наишао на наредно if у истом блоку. Односно, када видимо else у коду, 
# његово if му је оно у његовом блоку које му је најближе.

dalje ("Више if једно else")

a = 1.8

# Овде испод је код који је прављен да нађе најмањи цео број од кога је
# а мање или једнако, са границом на броју 6. Али направљена је грешка у коду.
# Једно средишње elif је замењено са if. Због тога уместо једног гранања
# са 7 грана, имамо заправо 2 гранања са по 4 гране
# (с тим да је else грана првог гранања празна, пошто му нема else блока)
# Уместо да нам се само испише један одговор, и то онај тачан, може нам се десити да
# нам се испишу два одговора, од којих је један погрешан.

if a <= 1: print ("a је мање или једнако 1")
elif a <= 2: print ("a је мање или једнако 2")
elif a <= 3: print ("a је мање или једнако 3")
if a <= 4: print ("a је мање или једнако 4")
elif a <= 5: print ("a је мање или једнако 5")
elif a <= 6: print ("a је мање или једнако 6")
else: print ("a је веће од 6")

dalje("Грешка са if уместо elif")

# Ово се лако поправи

if a <= 1: print ("a је мање или једнако 1")
elif a <= 2: print ("a је мање или једнако 2")
elif a <= 3: print ("a је мање или једнако 3")
elif a <= 4: print ("a је мање или једнако 4")
elif a <= 5: print ("a је мање или једнако 5")
elif a <= 6: print ("a је мање или једнако 6")
else: print ("a је веће од 6")

dalje ("Поправљено")

# Када нам једна провера није довољна да донесемо одлуку, можемо да правимо
# угњеждена гранања. Да би их правилно користили, морамо да разумемо табулацију
# и то како се завршају гране.

prvi_broj = 5
drugi_broj = 100

# Ако је први број непаран, јави то на конзоли, а онда провери да ли је други број
# већи од 50, па и то јави на конзоли
# Иначе, ако су оба броја парна, то јави на конзоли.
# Ако ниједан од ових услова није испуњен, јави на конзоли, а онда види да ли је збир
# та два броја већи од 200 и то да ли је или није јави на конзоли.

# Подсетимо се, парност се проверава тако што нађемо остатак при дељењу са 2
if prvi_broj%2==1:
    print ("Први број је непаран")
    if drugi_broj > 50:
        print ("Други број је већи од 50")
# Не морамо опет да проверавамо непарност првог броја
# Чим смо ушли у овај elif, знамо да нисмо прошли ту проверу
elif drugi_broj%2==0:
    print ("Оба броја су парна")
else:
    print ("Претходни услови нису испуњени")
    if prvi_broj+drugi_broj>200:
        print ("Збир је већи од 200")
    else:
        print ("Збир није већи од 200")

# Ако вас занима како ово ради, видите шта би требало да се деси за неке вредности
# првог и другог броја, а онда промените те вредности и покрените програм. Да ли се
# ово угњеждено гранање понаша онако како сте очекивали? Ако не, покушајте да видите
# зашто.

dalje("Угњеждено гранање")

# Понекад не желимо да правимо гранање само да би променили вредност једне променљиве
# Постоји посебан оператор који користи if else структуру за условну вредност
# то јест омогућава да на основу неког логичког услова
# променимо коју вредност желимо негде да користимо

a = 11
# Измените вредност а да промените рад овог дела кода
paran = "Јесте паран" if a % 2 == 0 else "Није паран"
print (paran)

# Понекад ћете чути да се ово назива "тернарни оператор"
# Тернатни оператор је било који оператор са 3 операнда
# У програмирању, оваква условна додела је обично једини такав оператор
# Па нема забуне

dalje("Тернарни оператор")

# Када имамо велик број појединих случајева које треба обрадити, код почиње да нам
# буде гломазан и нечитак. Идеално би било да нађемо начин да избегнемо већи број
# гранања, али ако нам стварно треба, за то постоји MATCH CASE наредба
# MATCH нам бира променљиву на основу чије вредности бирамо грану
# CASE нам означава посебан случај, то јест вредност за коју се извршава дата грана
# Симбол | нам значи да имамо више вредности за које се та грана извршава
# то јест, представља нам "или"
# Симбол _ нам означава да нам ниједан услов није испуњен
# Случајеви се гледају један по један од врха, слично као у IF ELIF ELSE блоку.
# Само један случај се извршава.

cifra = input ("Унесите, у бројчаном облику, неку цифру: ")

match cifra:
    case "0":
        print ("Нула")
    case "1":
        print ("Један")
    case "2":
        print ("Два")
    case "3" | "4" | "5" | "6" | "7" | "8" | "9":
        print ("Нека велика цифра")
    case _:
        print ("Оно што сте унели није цифра")

print()

# Понекад нам је унутар MATCH CASE потребно да будемо општији од појединог случаја
# На пример, ако нам треба да имамо услов да је неки број већи од нуле, нећемо
# набрајати све бројеве веће од нуле појединачно
# За то постоји додатни услов који ради слично као условна вредност
# Где понављамо променљиву коју користимо у MATCH и онда додајемо IF услов
# MATCH promenljiva:
# CASE promenljiva IF uslov:

broj = int (input("Унесите неки цео број:"))

match broj:
    case broj if broj > 0:
        print ("Број је већи од нуле")
    case broj if broj < 0:
        print ("Број је мањи од нуле")
    case 0:
        print ("Број је једнак нули")

# Унутар додатног услова може да се користи и кључна реч IN за припадност неком скупу
# case broj if broj in prosti_brojevi
# Где смо ми дефинисали скуп prosti_brojevi негде раније
# Више речи о скуповима ће бити негде другде

print()