# Знак # нам служи да започнемо коментар.
# Коментари су делови кода који се не извршавају
# Служе да се програмеру који чита код нешто појасни

# Када покренемо програм, требало би да видимо следеће позиве у конзоли:
# .../Python/Python313/python.exe 
# .../prazan.py"
# Могуће је да користите новију верзију Пајтона, у ком случају ће бројка бити већа
# Ако су позвани како треба, и програм не јавља грешку, успешно смо инсталирали Пајтон
# Можете променити име овог програма, на пример у "proba.py" и покренути га са конзоле
# Видећете да се променило име у позиву
# Ако га померите у неки други фолдер, видећете да се путања у позиву променила